app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    if params[:q]
      search_term = params[:q]
      @products = Product.search(search_term)

INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at", "colour", "price") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["description", ""], ["image_url", ""], ["created_at", "2017-05-25 01:33:03.970406"], ["updated_at", "2017-05-25 01:33:03.970406"], ["colour", ""], ["price", "5.50"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "image_url" = ?, "colour" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image_url", "https://pixabay.com/en/cat-animals-cats-portrait-of-cat-778315/"], ["colour", "green"], ["price", "20.00"], ["updated_at", "2017-05-25 01:44:53.511630"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)